n5/src/Documents/VendorDebts/VendorDebts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>VendorDebts</name>
  <registerRecords>AccumulationRegister.VendorInvoiceDebts</registerRecords>
  <registerRecords>AccountingRegister.General</registerRecords>
  <registerRecords>AccumulationRegister.PurchaseOrderDebts</registerRecords>
  <registerRecords>AccumulationRegister.VendorDebts</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvanceAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <attributes>
    <name>Advances</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorAccount</name>
    <type>
      <types>ChartOfAccountsRef.General</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Debts</name>
    <attributes>
      <name>Advance</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Contract</name>
      <type>
        <types>CatalogRef.Contracts</types>
      </type>
    </attributes>
    <attributes>
      <name>ContractAdvance</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>ContractAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Vendor</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.VendorInvoice</types>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>Option</name>
      <type>
        <types>CatalogRef.PaymentOptions</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Documents/VendorDebts/Forms/Form/Module.bsl
&AtClient
var DebtsRow export;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	DebtsForm.OnReadAtServer ( ThisObject );
	
EndProcedure

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	DebtsForm.OnCreateAtServer ( ThisObject );
		
EndProcedure

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.MessageChangesPermissionIsSaved ()
		and ( Parameter = Object.Ref
			or Parameter = BegOfDay ( Object.Date ) ) ) then
		updateChangesPermission ();
	endif;

EndProcedure

&AtServer
Procedure updateChangesPermission ()

	Constraints.ShowAccess ( ThisObject );

EndProcedure

&AtClient
Procedure BeforeWrite ( Cancel, WriteParameters )
	
	StandardButtons.AdjustSaving ( ThisObject, WriteParameters );
	Forms.DeleteLastRow ( Object.Debts, "Vendor" );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure DateOnChange ( Item )

	updateChangesPermission ();
	
EndProcedure

&AtClient
Procedure AccountOnChange ( Item )
	
	applyAccount ();
	
EndProcedure

&AtServer
Procedure applyAccount () 

	DebtsForm.ApplyAccount ( ThisObject );

EndProcedure

&AtClient
Procedure CurrencyOnChange ( Item )
	
	Appearance.Apply ( ThisObject, "Object.Currency" );
	
EndProcedure

// *****************************************
// *********** Table Debts

&AtClient
Procedure DebtsOnActivateRow ( Item )
	
	DebtsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure DebtsVendorOnChange ( Item )
	
	applyVendor ();
	
EndProcedure

&AtClient
Procedure applyVendor () 

	data = DF.Values ( DebtsRow.Vendor, "VendorContract, VendorContract.Company as Company, VendorContract.Currency as Currency" );
	if ( data.Company = Object.Company
		and data.Currency = Object.Currency ) then
		DebtsRow.Contract = data.VendorContract;
	endif; 

EndProcedure

&AtClient
Procedure DebtsAmountOnChange ( Item )
	
	DebtsForm.DebtsAmountOnChange ( ThisObject );
	
EndProcedure

&AtClient
Procedure DebtsAdvanceOnChange ( Item )
	
	DebtsForm.DebtsAdvanceOnChange ( ThisObject );
	
EndProcedure

&AtClient
Procedure DebtsOnEditEnd ( Item, NewRow, CancelEdit )
	
	DebtsForm.CalcTotals ( ThisObject );
	
EndProcedure

&AtClient
Procedure DebtsAfterDeleteRow ( Item )
	
	DebtsForm.CalcTotals ( ThisObject );
	
EndProcedure
